snowfox-project/snowfox/src/hal/avr/common/ATMEGA3209_4809/InterruptController.cpp
/**
 * Spectre is a modular RTOS with extensive IO support.
 * Copyright (C) 2017 - 2019 Alexander Entinger / LXRobotics GmbH
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

/**************************************************************************************
 * INCLUDE
 **************************************************************************************/

#include <spectre/hal/avr/common/ATMEGA3209_4809/InterruptController.h>

#include <spectre/util/BitManip.h>

#include <spectre/cpu/avr/io/common/ATMEGA3209_4809.h>

/**************************************************************************************
 * NAMESPACE
 **************************************************************************************/

namespace spectre
{

namespace hal
{

namespace ATMEGA3209_4809
{

/**************************************************************************************
 * GLOBAL VARIABLES
 **************************************************************************************/

static interface::InterruptCallback * isr_crc_nmi                         = 0,
                                    * isr_voltage_level_monitor           = 0,
                                    * isr_rtc_overflow_or_compare         = 0,
                                    * isr_rtc_periodic_interrupt          = 0,
                                    * isr_configurable_custom_logic       = 0,
                                    * isr_porta_external_int              = 0,
                                    * isr_timera0_overflow                = 0,
                                    * isr_timera0_underflow               = 0, /* For Timer A0 "Split Mode" */
                                    * isr_timera0_compare_0               = 0,
                                    * isr_timera0_compare_1               = 0,
                                    * isr_timera0_compare_2               = 0,
                                    * isr_timerb0_capture                 = 0,
                                    * isr_timerb1_capture                 = 0,
                                    * isr_twi0_slave                      = 0,
                                    * isr_twi0_master                     = 0,
                                    * isr_spi0                            = 0,
                                    * isr_usart0_receive_complete         = 0,
                                    * isr_usart0_uart_data_register_empty = 0,
                                    * isr_usart0_transmit_complete        = 0,
                                    * isr_portd_external_int              = 0,
                                    * isr_analog_comparator               = 0,
                                    * isr_adc0_result_ready               = 0,
                                    * isr_adc0_window_compare             = 0,
                                    * isr_portc_external_int              = 0,
                                    * isr_timerb2_capture                 = 0,
                                    * isr_usart1_receive_complete         = 0,
                                    * isr_usart1_uart_data_register_empty = 0,
                                    * isr_usart1_transmit_complete        = 0,
                                    * isr_portf_external_int              = 0,
                                    * isr_non_volatile_memory_ready       = 0,
                                    * isr_usart2_receive_complete         = 0,
                                    * isr_usart2_uart_data_register_empty = 0,
                                    * isr_usart2_transmit_complete        = 0,
                                    * isr_portb_external_int              = 0, /* Only for 48 pin package */
                                    * isr_porte_external_int              = 0, /* Only for 48 pin package */
                                    * isr_timerb3_capture                 = 0, /* Only for 48 pin package */
                                    * isr_usart3_receive_complete         = 0, /* Only for 48 pin package */
                                    * isr_usart3_uart_data_register_empty = 0, /* Only for 48 pin package */
                                    * isr_usart3_transmit_complete        = 0; /* Only for 48 pin package */

/**************************************************************************************
 * CTOR/DTOR
 **************************************************************************************/

InterruptController::InterruptController(volatile uint8_t * crcscan_ctrla,
                                         volatile uint8_t * bod_intctrl,
                                         volatile uint8_t * rtc_intctrl,
                                         volatile uint8_t * rtc_pitintctrl,
                                         volatile uint8_t * tca0_intctrl,
                                         volatile uint8_t * tcb0_intctrl,
                                         volatile uint8_t * tcb1_intctrl,
                                         volatile uint8_t * tcb2_intctrl,
                                         volatile uint8_t * tcb3_intctrl,
                                         volatile uint8_t * usart0_ctrla,
                                         volatile uint8_t * usart1_ctrla,
                                         volatile uint8_t * usart2_ctrla,
                                         volatile uint8_t * usart3_ctrla,
                                         volatile uint8_t * twi_mctrla,
                                         volatile uint8_t * twi_sctrla)
: _CRCSCAN_CTRLA (crcscan_ctrla ),
  _BOD_INTCTRL   (bod_intctrl   ),
  _RTC_INTCTRL   (rtc_intctrl   ),
  _RTC_PITINTCTRL(rtc_pitintctrl),
  _TCA0_INTCTRL  (tca0_intctrl  ),
  _TCB0_INTCTRL  (tcb0_intctrl  ),
  _TCB1_INTCTRL  (tcb1_intctrl  ),
  _TCB2_INTCTRL  (tcb2_intctrl  ),
  _TCB3_INTCTRL  (tcb3_intctrl  ),
  _USART0_CTRLA  (usart0_ctrla  ),
  _USART1_CTRLA  (usart1_ctrla  ),
  _USART2_CTRLA  (usart2_ctrla  ),
  _USART3_CTRLA  (usart3_ctrla  ),
  _TWI_MCTRLA    (twi_mctrla    ),
  _TWI_SCTRLA    (twi_sctrla    )
{

