snowfox-project/snowfox/src/hal/avr/common/ATMEGA3209_4809/InterruptController.cpp
}

InterruptController::~InterruptController()
{

}

/**************************************************************************************
 * PUBLIC MEMBER FUNCTIONS
 **************************************************************************************/

void InterruptController::enableInterrupt(uint8_t const int_num)
{
  switch(int_num)
  {
  case toIntNum(Interrupt::CRC_NMI                        ): util::setBit(_CRCSCAN_CTRLA,  CRCSCAN_NMIEN_bp); break;
  case toIntNum(Interrupt::VOLTAGE_LEVEL_MONITOR          ): util::setBit(_BOD_INTCTRL,    BOD_VLMIE_bp    ); break;
  /* RTC */
  case toIntNum(Interrupt::RTC_OVERFLOW                   ): util::setBit(_RTC_INTCTRL,    RTC_OVF_bp      ); break;
  case toIntNum(Interrupt::RTC_COMPARE                    ): util::setBit(_RTC_INTCTRL,    RTC_CMP_bp      ); break;
  case toIntNum(Interrupt::RTC_PERIODIC_INTERRUPT         ): util::setBit(_RTC_PITINTCTRL, RTC_PI_bp       ); break;
  /* TIMER A0 */
  case toIntNum(Interrupt::TIMERA0_OVER_UNDERFLOW         ): util::setBit(_TCA0_INTCTRL,   TCAx_OVF_bp     ); break;
  case toIntNum(Interrupt::TIMERA0_COMPARE_0              ): util::setBit(_TCA0_INTCTRL,   TCAx_CMP0_bp    ); break;
  case toIntNum(Interrupt::TIMERA0_COMPARE_1              ): util::setBit(_TCA0_INTCTRL,   TCAx_CMP1_bp    ); break;
  case toIntNum(Interrupt::TIMERA0_COMPARE_2              ): util::setBit(_TCA0_INTCTRL,   TCAx_CMP2_bp    ); break;
  /* TIMER B0/1/2/3 */
  case toIntNum(Interrupt::TIMERB0_CAPTURE                ): util::setBit(_TCB0_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB1_CAPTURE                ): util::setBit(_TCB1_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB2_CAPTURE                ): util::setBit(_TCB2_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB3_CAPTURE                ): util::setBit(_TCB3_INTCTRL,   TCBx_CAPT_bp    ); break;
  /* USART0 */
  case toIntNum(Interrupt::USART0_RECEIVE_COMPLETE        ): util::setBit(_USART0_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART0_TRANSMIT_COMPLETE       ): util::setBit(_USART0_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART0_UART_DATA_REGISTER_EMPTY): util::setBit(_USART0_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART0_RECEIVER_START_OF_FRAME ): util::setBit(_USART0_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART1 */
  case toIntNum(Interrupt::USART1_RECEIVE_COMPLETE        ): util::setBit(_USART1_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART1_TRANSMIT_COMPLETE       ): util::setBit(_USART1_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART1_UART_DATA_REGISTER_EMPTY): util::setBit(_USART1_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART1_RECEIVER_START_OF_FRAME ): util::setBit(_USART1_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART2 */
  case toIntNum(Interrupt::USART2_RECEIVE_COMPLETE        ): util::setBit(_USART2_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART2_TRANSMIT_COMPLETE       ): util::setBit(_USART2_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART2_UART_DATA_REGISTER_EMPTY): util::setBit(_USART2_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART2_RECEIVER_START_OF_FRAME ): util::setBit(_USART2_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART3 */
  case toIntNum(Interrupt::USART3_RECEIVE_COMPLETE        ): util::setBit(_USART3_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART3_TRANSMIT_COMPLETE       ): util::setBit(_USART3_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART3_UART_DATA_REGISTER_EMPTY): util::setBit(_USART3_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART3_RECEIVER_START_OF_FRAME ): util::setBit(_USART3_CTRLA,   USARTx_RXSIE_bp ); break;
  /* TWI0_MASTER/SLAVE */
  case toIntNum(Interrupt::TWI0_MASTER_READ               ): util::setBit(_TWI_MCTRLA,     TWI_RIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_MASTER_WRITE              ): util::setBit(_TWI_MCTRLA,     TWI_WIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_DATA                ): util::setBit(_TWI_SCTRLA,     TWI_DIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_ADDRESS_OR_STOP     ): util::setBit(_TWI_SCTRLA,     TWI_APIEN_bp    ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_STOP                ): util::setBit(_TWI_SCTRLA,     TWI_PIEN_bp     ); break;
  /* GLOBAL */
#if defined(MCU_ARCH_avr)
  case toIntNum(Interrupt::GLOBAL                         ): asm volatile("sei");                             break;
#endif
  }
}

void InterruptController::disableInterrupt(uint8_t const int_num)
{
  switch(int_num)
  {
  case toIntNum(Interrupt::CRC_NMI                        ): util::clrBit(_CRCSCAN_CTRLA,  CRCSCAN_NMIEN_bp); break;
  case toIntNum(Interrupt::VOLTAGE_LEVEL_MONITOR          ): util::clrBit(_BOD_INTCTRL,    BOD_VLMIE_bp    ); break;
  /* RTC */
  case toIntNum(Interrupt::RTC_OVERFLOW                   ): util::clrBit(_RTC_INTCTRL,    RTC_OVF_bp      ); break;
  case toIntNum(Interrupt::RTC_COMPARE                    ): util::clrBit(_RTC_INTCTRL,    RTC_CMP_bp      ); break;
  case toIntNum(Interrupt::RTC_PERIODIC_INTERRUPT         ): util::clrBit(_RTC_PITINTCTRL, RTC_PI_bp       ); break;
  /* TIMER A0 */
  case toIntNum(Interrupt::TIMERA0_OVER_UNDERFLOW         ): util::clrBit(_TCA0_INTCTRL,   TCAx_OVF_bp     ); break;
  case toIntNum(Interrupt::TIMERA0_COMPARE_0              ): util::clrBit(_TCA0_INTCTRL,   TCAx_CMP0_bp    ); break;
  case toIntNum(Interrupt::TIMERA0_COMPARE_1              ): util::clrBit(_TCA0_INTCTRL,   TCAx_CMP1_bp    ); break;
  /* TIMER B0/1/2/3 */
  case toIntNum(Interrupt::TIMERB0_CAPTURE                ): util::clrBit(_TCB0_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB1_CAPTURE                ): util::clrBit(_TCB1_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB2_CAPTURE                ): util::clrBit(_TCB2_INTCTRL,   TCBx_CAPT_bp    ); break;
  case toIntNum(Interrupt::TIMERB3_CAPTURE                ): util::clrBit(_TCB3_INTCTRL,   TCBx_CAPT_bp    ); break;
  /* USART0 */
  case toIntNum(Interrupt::USART0_RECEIVE_COMPLETE        ): util::clrBit(_USART0_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART0_TRANSMIT_COMPLETE       ): util::clrBit(_USART0_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART0_UART_DATA_REGISTER_EMPTY): util::clrBit(_USART0_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART0_RECEIVER_START_OF_FRAME ): util::clrBit(_USART0_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART1 */
  case toIntNum(Interrupt::USART1_RECEIVE_COMPLETE        ): util::clrBit(_USART1_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART1_TRANSMIT_COMPLETE       ): util::clrBit(_USART1_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART1_UART_DATA_REGISTER_EMPTY): util::clrBit(_USART1_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART1_RECEIVER_START_OF_FRAME ): util::clrBit(_USART1_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART2 */
  case toIntNum(Interrupt::USART2_RECEIVE_COMPLETE        ): util::clrBit(_USART2_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART2_TRANSMIT_COMPLETE       ): util::clrBit(_USART2_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART2_UART_DATA_REGISTER_EMPTY): util::clrBit(_USART2_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART2_RECEIVER_START_OF_FRAME ): util::clrBit(_USART2_CTRLA,   USARTx_RXSIE_bp ); break;
  /* USART3 */
  case toIntNum(Interrupt::USART3_RECEIVE_COMPLETE        ): util::clrBit(_USART3_CTRLA,   USARTx_RXCIE_bp ); break;
  case toIntNum(Interrupt::USART3_TRANSMIT_COMPLETE       ): util::clrBit(_USART3_CTRLA,   USARTx_TXCIE_bp ); break;
  case toIntNum(Interrupt::USART3_UART_DATA_REGISTER_EMPTY): util::clrBit(_USART3_CTRLA,   USARTx_DREIE_bp ); break;
  case toIntNum(Interrupt::USART3_RECEIVER_START_OF_FRAME ): util::clrBit(_USART3_CTRLA,   USARTx_RXSIE_bp ); break;
  /* TWI0_MASTER/SLAVE */
  case toIntNum(Interrupt::TWI0_MASTER_READ               ): util::clrBit(_TWI_MCTRLA,     TWI_RIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_MASTER_WRITE              ): util::clrBit(_TWI_MCTRLA,     TWI_WIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_DATA                ): util::clrBit(_TWI_SCTRLA,     TWI_DIEN_bp     ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_ADDRESS_OR_STOP     ): util::clrBit(_TWI_SCTRLA,     TWI_APIEN_bp    ); break;
  case toIntNum(Interrupt::TWI0_SLAVE_STOP                ): util::clrBit(_TWI_SCTRLA,     TWI_PIEN_bp     ); break;
  /* GLOBAL */
#if defined(MCU_ARCH_avr)
  case toIntNum(Interrupt::GLOBAL                         ): asm volatile("cli");                             break;
#endif
  }
}

void InterruptController::registerInterruptCallback(uint8_t const isr_num, interface::InterruptCallback * interrupt_callback)
{
  switch(isr_num)
  {
  case toIsrNum(Isr::CRC_NMI                        ): isr_crc_nmi                         = interrupt_callback; break;
  case toIsrNum(Isr::VOLTAGE_LEVEL_MONITOR          ): isr_voltage_level_monitor           = interrupt_callback; break;
  case toIsrNum(Isr::RTC_OVERFLOW_OR_COMPARE        ): isr_rtc_overflow_or_compare         = interrupt_callback; break;
  case toIsrNum(Isr::RTC_PERIODIC_INTERRUPT         ): isr_rtc_periodic_interrupt          = interrupt_callback; break;
  case toIsrNum(Isr::CONFIGURABLE_CUSTOM_LOGIC      ): isr_configurable_custom_logic       = interrupt_callback; break;
  case toIsrNum(Isr::PORTA_EXTERNAL_INT             ): isr_porta_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::TIMERA0_OVERFLOW               ): isr_timera0_overflow                = interrupt_callback; break;
  case toIsrNum(Isr::TIMERA0_UNDERFLOW              ): isr_timera0_underflow               = interrupt_callback; break;
  case toIsrNum(Isr::TIMERA0_COMPARE_0              ): isr_timera0_compare_0               = interrupt_callback; break;
  case toIsrNum(Isr::TIMERA0_COMPARE_1              ): isr_timera0_compare_1               = interrupt_callback; break;
  case toIsrNum(Isr::TIMERA0_COMPARE_2              ): isr_timera0_compare_2               = interrupt_callback; break;
  case toIsrNum(Isr::TIMERB0_CAPTURE                ): isr_timerb0_capture                 = interrupt_callback; break;
  case toIsrNum(Isr::TIMERB1_CAPTURE                ): isr_timerb1_capture                 = interrupt_callback; break;
  case toIsrNum(Isr::TWI0_SLAVE                     ): isr_twi0_slave                      = interrupt_callback; break;
  case toIsrNum(Isr::TWI0_MASTER                    ): isr_twi0_master                     = interrupt_callback; break;
  case toIsrNum(Isr::SPI0                           ): isr_spi0                            = interrupt_callback; break;
  case toIsrNum(Isr::USART0_RECEIVE_COMPLETE        ): isr_usart0_receive_complete         = interrupt_callback; break;
  case toIsrNum(Isr::USART0_UART_DATA_REGISTER_EMPTY): isr_usart0_uart_data_register_empty = interrupt_callback; break;
  case toIsrNum(Isr::USART0_TRANSMIT_COMPLETE       ): isr_usart0_transmit_complete        = interrupt_callback; break;
  case toIsrNum(Isr::PORTD_EXTERNAL_INT             ): isr_portd_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::ANALOG_COMPARATOR              ): isr_analog_comparator               = interrupt_callback; break;
  case toIsrNum(Isr::ADC0_RESULT_READY              ): isr_adc0_result_ready               = interrupt_callback; break;
  case toIsrNum(Isr::ADC0_WINDOW_COMPARE            ): isr_adc0_window_compare             = interrupt_callback; break;
  case toIsrNum(Isr::PORTC_EXTERNAL_INT             ): isr_portc_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::TIMERB2_CAPTURE                ): isr_timerb2_capture                 = interrupt_callback; break;
  case toIsrNum(Isr::USART1_RECEIVE_COMPLETE        ): isr_usart1_receive_complete         = interrupt_callback; break;
  case toIsrNum(Isr::USART1_UART_DATA_REGISTER_EMPTY): isr_usart1_uart_data_register_empty = interrupt_callback; break;
  case toIsrNum(Isr::USART1_TRANSMIT_COMPLETE       ): isr_usart1_transmit_complete        = interrupt_callback; break;
  case toIsrNum(Isr::PORTF_EXTERNAL_INT             ): isr_portf_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::NON_VOLATILE_MEMORY_READY      ): isr_non_volatile_memory_ready       = interrupt_callback; break;
  case toIsrNum(Isr::USART2_RECEIVE_COMPLETE        ): isr_usart2_receive_complete         = interrupt_callback; break;
  case toIsrNum(Isr::USART2_UART_DATA_REGISTER_EMPTY): isr_usart2_uart_data_register_empty = interrupt_callback; break;
  case toIsrNum(Isr::USART2_TRANSMIT_COMPLETE       ): isr_usart2_transmit_complete        = interrupt_callback; break;
  case toIsrNum(Isr::PORTB_EXTERNAL_INT             ): isr_portb_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::PORTE_EXTERNAL_INT             ): isr_porte_external_int              = interrupt_callback; break;
  case toIsrNum(Isr::TIMERB3_CAPTURE                ): isr_timerb3_capture                 = interrupt_callback; break;
  case toIsrNum(Isr::USART3_RECEIVE_COMPLETE        ): isr_usart3_receive_complete         = interrupt_callback; break;
  case toIsrNum(Isr::USART3_UART_DATA_REGISTER_EMPTY): isr_usart3_uart_data_register_empty = interrupt_callback; break;
  case toIsrNum(Isr::USART3_TRANSMIT_COMPLETE       ): isr_usart3_transmit_complete        = interrupt_callback; break;
  }
}

/**************************************************************************************
 * NAMESPACE
 **************************************************************************************/

} /* ATMEGA3209_4809 */

