snowfox-project/snowfox/src/hal/avr/common/ATMEGA3209_4809/InterruptController.cpp
} /* hal */

} /* spectre */

/**************************************************************************************
 * INTERRUPT SERVICE ROUTINES
 **************************************************************************************/

#if defined(MCU_ARCH_avr) && ( defined(MCU_TYPE_atmega3209) || defined(MCU_TYPE_atmega4809) )

/**************************************************************************************
 * INCLUDE
 **************************************************************************************/

#include <avr/io.h>
#include <avr/interrupt.h>

/**************************************************************************************
 * NAMESPACES
 **************************************************************************************/

using namespace spectre::hal::ATMEGA3209_4809;

/**************************************************************************************
 * INTERRUPT SERVICE ROUTINES
 **************************************************************************************/

ISR(CRCSCAN_NMI_vect)
{
  executeCallbackIfValid(isr_crc_nmi);
}

ISR(BOD_VLM_vect)
{
  executeCallbackIfValid(isr_voltage_level_monitor);
}

ISR(RTC_CNT_vect)
{
  executeCallbackIfValid(isr_rtc_overflow_or_compare);
}

ISR(RTC_PIT_vect)
{
  executeCallbackIfValid(isr_rtc_periodic_interrupt);
}

ISR(CCL_CCL_vect)
{
  executeCallbackIfValid(isr_configurable_custom_logic);
}

ISR(PORTA_PORT_vect)
{
  executeCallbackIfValid(isr_porta_external_int);
}

ISR(TCA0_OVF_vect)
{
  executeCallbackIfValid(isr_timera0_overflow);
}

ISR(TCA0_HUNF_vect)
{
  executeCallbackIfValid(isr_timera0_underflow);
}

ISR(TCA0_CMP0_vect)
{
  executeCallbackIfValid(isr_timera0_compare_0);
}

ISR(TCA0_CMP1_vect)
{
  executeCallbackIfValid(isr_timera0_compare_1);
}

ISR(TCA0_CMP2_vect)
{
  executeCallbackIfValid(isr_timera0_compare_2);
}

ISR(TCB0_INT_vect)
{
  executeCallbackIfValid(isr_timerb0_capture);
}

ISR(TCB1_INT_vect)
{
  executeCallbackIfValid(isr_timerb1_capture);
}

ISR(TWI0_TWIS_vect)
{
  executeCallbackIfValid(isr_twi0_slave);
}

ISR(TWI0_TWIM_vect)
{
  executeCallbackIfValid(isr_twi0_master);
}

ISR(SPI0_INT_vect)
{
  executeCallbackIfValid(isr_spi0);
}

ISR(USART0_RXC_vect)
{
  executeCallbackIfValid(isr_usart0_receive_complete);
}

ISR(USART0_DRE_vect)
{
  executeCallbackIfValid(isr_usart0_uart_data_register_empty);
}

ISR(USART0_TXC_vect)
{
  executeCallbackIfValid(isr_usart0_transmit_complete);
}

ISR(PORTD_PORT_vect)
{
  executeCallbackIfValid(isr_portd_external_int);
}

ISR(AC0_AC_vect)
{
  executeCallbackIfValid(isr_analog_comparator);
}

ISR(ADC0_RESRDY_vect)
{
  executeCallbackIfValid(isr_adc0_result_ready);
}

ISR(ADC0_WCOMP_vect)
{
  executeCallbackIfValid(isr_adc0_window_compare);
}

ISR(PORTC_PORT_vect)
{
  executeCallbackIfValid(isr_portc_external_int);
}

ISR(TCB2_INT_vect)
{
  executeCallbackIfValid(isr_timerb2_capture);
}

ISR(USART1_RXC_vect)
{
  executeCallbackIfValid(isr_usart1_receive_complete);
}

ISR(USART1_DRE_vect)
{
  executeCallbackIfValid(isr_usart1_uart_data_register_empty);
}

ISR(USART1_TXC_vect)
{
  executeCallbackIfValid(isr_usart1_transmit_complete);
}

ISR(PORTF_PORT_vect)
{
  executeCallbackIfValid(isr_portf_external_int);
}

ISR(NVMCTRL_EE_vect)
{
  executeCallbackIfValid(isr_non_volatile_memory_ready);
}

ISR(USART2_RXC_vect)
{
  executeCallbackIfValid(isr_usart2_receive_complete);
}

ISR(USART2_DRE_vect)
{
  executeCallbackIfValid(isr_usart2_uart_data_register_empty);
}

ISR(USART2_TXC_vect)
{
  executeCallbackIfValid(isr_usart2_transmit_complete);
}

ISR(PORTB_PORT_vect)
{
  executeCallbackIfValid(isr_portb_external_int);
}

ISR(PORTE_PORT_vect)
{
  executeCallbackIfValid(isr_porte_external_int);
}

ISR(TCB3_INT_vect)
{
  executeCallbackIfValid(isr_timerb3_capture);
}

ISR(USART3_RXC_vect)
{
  executeCallbackIfValid(isr_usart3_receive_complete);
}

ISR(USART3_DRE_vect)
{
  executeCallbackIfValid(isr_usart3_uart_data_register_empty);
}

ISR(USART3_TXC_vect)
{
  executeCallbackIfValid(isr_usart3_transmit_complete);
}

#endif /* defined(MCU_ARCH_avr) && ( defined(MCU_TYPE_atmega3209) || defined(MCU_TYPE_atmega4809) ) */
